{
    "gloss_to_idx": {
        "accept": 0,
        "accident": 1,
        "africa": 2,
        "again": 3,
        "ago": 4,
        "alone": 5,
        "already": 6,
        "animal": 7,
        "apple": 8,
        "appointment": 9,
        "approve": 10,
        "argue": 11,
        "arrive": 12,
        "australia": 13,
        "awful": 14,
        "awkward": 15,
        "baby": 16,
        "backpack": 17,
        "bad": 18,
        "balance": 19,
        "ball": 20,
        "balloon": 21,
        "banana": 22,
        "bar": 23,
        "barely": 24,
        "bark": 25,
        "basketball": 26,
        "beard": 27,
        "because": 28,
        "bed": 29,
        "beer": 30,
        "before": 31,
        "bird": 32,
        "bitter": 33,
        "black": 34,
        "blanket": 35,
        "blind": 36,
        "bottom": 37,
        "bowling": 38,
        "bread": 39,
        "brother": 40,
        "buy": 41,
        "cafeteria": 42,
        "california": 43,
        "call": 44,
        "can": 45,
        "cancel": 46,
        "candy": 47,
        "careful": 48,
        "carrot": 49,
        "catch": 50,
        "champion": 51,
        "change": 52,
        "chat": 53,
        "cheat": 54,
        "check": 55,
        "child": 56,
        "choice": 57,
        "choose": 58,
        "christmas": 59,
        "class": 60,
        "close": 61,
        "cloud": 62,
        "cold": 63,
        "color": 64,
        "computer": 65,
        "contact": 66,
        "convince": 67,
        "cook": 68,
        "cookie": 69,
        "cool": 70,
        "cop": 71,
        "copy": 72,
        "corn": 73,
        "correct": 74,
        "country": 75,
        "cousin": 76,
        "cow": 77,
        "crash": 78,
        "cry": 79,
        "cut": 80,
        "cute": 81,
        "dark": 82,
        "daughter": 83,
        "day": 84,
        "deaf": 85,
        "decide": 86,
        "decorate": 87,
        "deep": 88,
        "delay": 89,
        "delicious": 90,
        "demand": 91,
        "dentist": 92,
        "different": 93,
        "dirty": 94,
        "disappear": 95,
        "discuss": 96,
        "dive": 97,
        "doctor": 98,
        "dog": 99,
        "dollar": 100,
        "dress": 101,
        "drink": 102,
        "drop": 103,
        "dry": 104,
        "east": 105,
        "enjoy": 106,
        "environment": 107,
        "escape": 108,
        "europe": 109,
        "example": 110,
        "exchange": 111,
        "expensive": 112,
        "explain": 113,
        "family": 114,
        "far": 115,
        "fat": 116,
        "fault": 117,
        "find": 118,
        "fine": 119,
        "finish": 120,
        "fish": 121,
        "fly": 122,
        "follow": 123,
        "football": 124,
        "form": 125,
        "full": 126,
        "future": 127,
        "girl": 128,
        "give": 129,
        "glasses": 130,
        "go": 131,
        "good": 132,
        "government": 133,
        "graduate": 134,
        "grammar": 135,
        "great": 136,
        "hair": 137,
        "halloween": 138,
        "happy": 139,
        "hat": 140,
        "headache": 141,
        "hear": 142,
        "hearing": 143,
        "heart": 144,
        "help": 145,
        "her": 146,
        "hope": 147,
        "hospital": 148,
        "hot": 149,
        "hour": 150,
        "how": 151,
        "humble": 152,
        "hurry": 153,
        "idea": 154,
        "improve": 155,
        "inform": 156,
        "interest": 157,
        "internet": 158,
        "jacket": 159,
        "japan": 160,
        "jealous": 161,
        "join": 162,
        "kiss": 163,
        "know": 164,
        "language": 165,
        "large": 166,
        "last": 167,
        "late": 168,
        "later": 169,
        "laugh": 170,
        "learn": 171,
        "leave": 172,
        "letter": 173,
        "light": 174,
        "like": 175,
        "list": 176,
        "lose": 177,
        "make": 178,
        "man": 179,
        "many": 180,
        "match": 181,
        "mean": 182,
        "meat": 183,
        "medicine": 184,
        "meet": 185,
        "minute": 186,
        "mirror": 187,
        "miss": 188,
        "more": 189,
        "mother": 190,
        "motorcycle": 191,
        "move": 192,
        "music": 193,
        "near": 194,
        "necklace": 195,
        "new": 196,
        "no": 197,
        "north": 198,
        "not": 199,
        "now": 200,
        "office": 201,
        "ok": 202,
        "onion": 203,
        "orange": 204,
        "order": 205,
        "outside": 206,
        "paint": 207,
        "pants": 208,
        "paper": 209,
        "party": 210,
        "past": 211,
        "pepper": 212,
        "perspective": 213,
        "pink": 214,
        "pizza": 215,
        "play": 216,
        "point": 217,
        "police": 218,
        "possible": 219,
        "postpone": 220,
        "potato": 221,
        "practice": 222,
        "present": 223,
        "presentation": 224,
        "president": 225,
        "problem": 226,
        "pull": 227,
        "rabbit": 228,
        "ready": 229,
        "ride": 230,
        "right": 231,
        "rob": 232,
        "room": 233,
        "run": 234,
        "russia": 235,
        "sad": 236,
        "same": 237,
        "sandwich": 238,
        "save": 239,
        "scared": 240,
        "school": 241,
        "science": 242,
        "scissors": 243,
        "score": 244,
        "secret": 245,
        "secretary": 246,
        "sentence": 247,
        "shine": 248,
        "shirt": 249,
        "shock": 250,
        "short": 251,
        "show": 252,
        "sign": 253,
        "silly": 254,
        "slow": 255,
        "small": 256,
        "smart": 257,
        "snow": 258,
        "son": 259,
        "soon": 260,
        "south": 261,
        "speech": 262,
        "spin": 263,
        "spray": 264,
        "star": 265,
        "stay": 266,
        "straight": 267,
        "student": 268,
        "study": 269,
        "sunday": 270,
        "sunset": 271,
        "surgery": 272,
        "sweet": 273,
        "take": 274,
        "talk": 275,
        "tall": 276,
        "tea": 277,
        "teach": 278,
        "teacher": 279,
        "tease": 280,
        "tell": 281,
        "temperature": 282,
        "tent": 283,
        "test": 284,
        "thanksgiving": 285,
        "theory": 286,
        "thin": 287,
        "thursday": 288,
        "tiger": 289,
        "tired": 290,
        "toast": 291,
        "today": 292,
        "tomato": 293,
        "town": 294,
        "trade": 295,
        "train": 296,
        "transfer": 297,
        "travel": 298,
        "ugly": 299
    },
    "idx_to_gloss": {
        "0": "accept",
        "1": "accident",
        "2": "africa",
        "3": "again",
        "4": "ago",
        "5": "alone",
        "6": "already",
        "7": "animal",
        "8": "apple",
        "9": "appointment",
        "10": "approve",
        "11": "argue",
        "12": "arrive",
        "13": "australia",
        "14": "awful",
        "15": "awkward",
        "16": "baby",
        "17": "backpack",
        "18": "bad",
        "19": "balance",
        "20": "ball",
        "21": "balloon",
        "22": "banana",
        "23": "bar",
        "24": "barely",
        "25": "bark",
        "26": "basketball",
        "27": "beard",
        "28": "because",
        "29": "bed",
        "30": "beer",
        "31": "before",
        "32": "bird",
        "33": "bitter",
        "34": "black",
        "35": "blanket",
        "36": "blind",
        "37": "bottom",
        "38": "bowling",
        "39": "bread",
        "40": "brother",
        "41": "buy",
        "42": "cafeteria",
        "43": "california",
        "44": "call",
        "45": "can",
        "46": "cancel",
        "47": "candy",
        "48": "careful",
        "49": "carrot",
        "50": "catch",
        "51": "champion",
        "52": "change",
        "53": "chat",
        "54": "cheat",
        "55": "check",
        "56": "child",
        "57": "choice",
        "58": "choose",
        "59": "christmas",
        "60": "class",
        "61": "close",
        "62": "cloud",
        "63": "cold",
        "64": "color",
        "65": "computer",
        "66": "contact",
        "67": "convince",
        "68": "cook",
        "69": "cookie",
        "70": "cool",
        "71": "cop",
        "72": "copy",
        "73": "corn",
        "74": "correct",
        "75": "country",
        "76": "cousin",
        "77": "cow",
        "78": "crash",
        "79": "cry",
        "80": "cut",
        "81": "cute",
        "82": "dark",
        "83": "daughter",
        "84": "day",
        "85": "deaf",
        "86": "decide",
        "87": "decorate",
        "88": "deep",
        "89": "delay",
        "90": "delicious",
        "91": "demand",
        "92": "dentist",
        "93": "different",
        "94": "dirty",
        "95": "disappear",
        "96": "discuss",
        "97": "dive",
        "98": "doctor",
        "99": "dog",
        "100": "dollar",
        "101": "dress",
        "102": "drink",
        "103": "drop",
        "104": "dry",
        "105": "east",
        "106": "enjoy",
        "107": "environment",
        "108": "escape",
        "109": "europe",
        "110": "example",
        "111": "exchange",
        "112": "expensive",
        "113": "explain",
        "114": "family",
        "115": "far",
        "116": "fat",
        "117": "fault",
        "118": "find",
        "119": "fine",
        "120": "finish",
        "121": "fish",
        "122": "fly",
        "123": "follow",
        "124": "football",
        "125": "form",
        "126": "full",
        "127": "future",
        "128": "girl",
        "129": "give",
        "130": "glasses",
        "131": "go",
        "132": "good",
        "133": "government",
        "134": "graduate",
        "135": "grammar",
        "136": "great",
        "137": "hair",
        "138": "halloween",
        "139": "happy",
        "140": "hat",
        "141": "headache",
        "142": "hear",
        "143": "hearing",
        "144": "heart",
        "145": "help",
        "146": "her",
        "147": "hope",
        "148": "hospital",
        "149": "hot",
        "150": "hour",
        "151": "how",
        "152": "humble",
        "153": "hurry",
        "154": "idea",
        "155": "improve",
        "156": "inform",
        "157": "interest",
        "158": "internet",
        "159": "jacket",
        "160": "japan",
        "161": "jealous",
        "162": "join",
        "163": "kiss",
        "164": "know",
        "165": "language",
        "166": "large",
        "167": "last",
        "168": "late",
        "169": "later",
        "170": "laugh",
        "171": "learn",
        "172": "leave",
        "173": "letter",
        "174": "light",
        "175": "like",
        "176": "list",
        "177": "lose",
        "178": "make",
        "179": "man",
        "180": "many",
        "181": "match",
        "182": "mean",
        "183": "meat",
        "184": "medicine",
        "185": "meet",
        "186": "minute",
        "187": "mirror",
        "188": "miss",
        "189": "more",
        "190": "mother",
        "191": "motorcycle",
        "192": "move",
        "193": "music",
        "194": "near",
        "195": "necklace",
        "196": "new",
        "197": "no",
        "198": "north",
        "199": "not",
        "200": "now",
        "201": "office",
        "202": "ok",
        "203": "onion",
        "204": "orange",
        "205": "order",
        "206": "outside",
        "207": "paint",
        "208": "pants",
        "209": "paper",
        "210": "party",
        "211": "past",
        "212": "pepper",
        "213": "perspective",
        "214": "pink",
        "215": "pizza",
        "216": "play",
        "217": "point",
        "218": "police",
        "219": "possible",
        "220": "postpone",
        "221": "potato",
        "222": "practice",
        "223": "present",
        "224": "presentation",
        "225": "president",
        "226": "problem",
        "227": "pull",
        "228": "rabbit",
        "229": "ready",
        "230": "ride",
        "231": "right",
        "232": "rob",
        "233": "room",
        "234": "run",
        "235": "russia",
        "236": "sad",
        "237": "same",
        "238": "sandwich",
        "239": "save",
        "240": "scared",
        "241": "school",
        "242": "science",
        "243": "scissors",
        "244": "score",
        "245": "secret",
        "246": "secretary",
        "247": "sentence",
        "248": "shine",
        "249": "shirt",
        "250": "shock",
        "251": "short",
        "252": "show",
        "253": "sign",
        "254": "silly",
        "255": "slow",
        "256": "small",
        "257": "smart",
        "258": "snow",
        "259": "son",
        "260": "soon",
        "261": "south",
        "262": "speech",
        "263": "spin",
        "264": "spray",
        "265": "star",
        "266": "stay",
        "267": "straight",
        "268": "student",
        "269": "study",
        "270": "sunday",
        "271": "sunset",
        "272": "surgery",
        "273": "sweet",
        "274": "take",
        "275": "talk",
        "276": "tall",
        "277": "tea",
        "278": "teach",
        "279": "teacher",
        "280": "tease",
        "281": "tell",
        "282": "temperature",
        "283": "tent",
        "284": "test",
        "285": "thanksgiving",
        "286": "theory",
        "287": "thin",
        "288": "thursday",
        "289": "tiger",
        "290": "tired",
        "291": "toast",
        "292": "today",
        "293": "tomato",
        "294": "town",
        "295": "trade",
        "296": "train",
        "297": "transfer",
        "298": "travel",
        "299": "ugly"
    },
    "num_classes": 300
}